xml/request/3.simple_facet.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/opensearch">
  <SOAP-ENV:Body>
    <open:searchRequest>
      <open:query>danmark</open:query>
      <open:agency>100200</open:agency>
      <open:profile>test</open:profile>
      <open:facets>
        <open:numberOfTerms>10</open:numberOfTerms>
        <open:facetSort>count</open:facetSort>
        <open:facetMinCount>1</open:facetMinCount>
        <open:facetName>facet.creator</open:facetName>
      </open:facets>
      <open:start>1</open:start>
      <open:stepValue>1</open:stepValue>
    </open:searchRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
