xml/request/search_zorro.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/opensearch"><SOAP-ENV:Body>
<ns1:searchRequest>
 <ns1:query>dc.title=zorro</ns1:query>
 <ns1:facets>
  <ns1:numberOfTerms>10</ns1:numberOfTerms>
  <ns1:facetName>facet.creator</ns1:facetName>
 </ns1:facets>
 <ns1:source></ns1:source>
 <ns1:start>0</ns1:start>
 <ns1:stepValue>10</ns1:stepValue>
</ns1:searchRequest>
</SOAP-ENV:Body></SOAP-ENV:Envelope>
