tests/requests/example/search_queryResultExplanation.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/opensearch"><SOAP-ENV:Body>
<open:searchRequest>
    <open:query>old</open:query>
    <open:start>1</open:start>
    <open:stepValue>2</open:stepValue>    
    <open:sort>rank_none</open:sort>  
    <open:queryDebug>1</open:queryDebug>    
</open:searchRequest>
</SOAP-ENV:Body></SOAP-ENV:Envelope>
